Revit 2024 API
PlanViewRange.Unlimited Property
 View range is unlimited
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ElementId Unlimited { get; }
Visual Basic
Public Shared ReadOnly Property Unlimited As ElementId
	Get
Visual C++
public:
static property ElementId^ Unlimited {
	ElementId^ get ();
}
See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace